{"pages":[{"title":"<i class='fab fa-d3 d3fa-color-blue'><\/i> Geburtstagsgutscheine","text":"Kauf und weitere Informationen zum Modul Geburtstagsgutscheine finden Sie in unserem Shop: https:\/\/www.oxidmodule.com\/OXID-eShop\/Module\/Geburtstagsgutschein-fuer-Oxid-PE.html","tags":"","url":"index.html"},{"title":"Changelog","text":"4.0.0.0 04.07.2018 Umarbeitung für OXID 6 3.2.0.0 17.10.2016 neue Funktion Ablaufwarnung für Gutscheine mit Ablaufdatum neue Funtkion Erinnerungsfunktion für Gutscheine ohne Ablaufdatum 3.1.0.4 02.09.2016 Test und Anpassung auf Version 4.10 \/ 5.3 Bugfix: Logout im Admin, im Zusammenhang mit dem aktuellen Modul-Connnector und dem neuen Admin-Theme neuer Menüpunkt Logmeldungen im Modul Gutscheine haben jetzt ein Gültig-Bis Datum Logmeldungen des Moduls sind jetzt über die Menüstruktur des Moduls erreichbar 3.1.0.3 15.07.2015 Test \/ Anpassung auf 4.9 \/ 5.2 Test \/ Anpassung auf PHP 5.4 und PHP 5.6 3.1.0.2 12.08.2.14 Fehler bei Speicherung der Kundengruppen 3.1.0.1 28.04.2014 Änderung Precheck 3.1.0.0 26.02.2014 Testmodus implementiert Einschränkungen auf Kundengruppen Einschränkung für E-Mailadressen Logging erweitert Altersbegrenzung implementiert 3.0.1.0 03.01.2014 Test\/Anpassung auf 4.8 \/ 5.0 kleine Schönheitskorrekturen im Modul 3.0.0.1 Bugfix, mit angeschaltetem Modul wurde ein Fehler beim Registrieren erzeugt, Kunde wurde angelegt, jedoch fehlten einige Kundendaten, er bekam im Frontend eine Fehlermeldung und er wurde nicht automatisch eingeloggt 3.0.0.0 30.04.2013 Anpassung für PE\/CE 4.7 - EE 5.0 halbautomatische Installation Verwaltung über Lizenzschlüssel Verhinderung von Betrugsversuchen 2.2.2 für 4.6, nur noch lauffähig ab 4.5 E-Mails werden in der History angelegt Zusätzliche Option um Kunden ohne Kundenkonto auszuschließen 2.2.1 Bug mit E-Mails in anderen Sprachen, Hilfetexte Prüfung ob generierter Gutscheincode schon vorhanden ist 2.2.0 Anpassung an 4.5.x, eigener Adminbereich, 2.0 Komplette Überarbeitung des Moduls für OXID4 1.3 Geburtstagsgutscheine können zeitlich begrenzt werden 1.2 Mailtemplates werden nun in verschiedenen Sprachen geschickt 1.1 Im Template werden jetzt die Rabatte automatisch eingetragen.","tags":"","url":"changelog\/Changelog.html"},{"title":"Systemanforderungen","text":"PHP Version 5.6.x bis PHP 7.0.x PHP Decoder installierter ionCube Loader *Shopversionen \/ -editionen OXID eShop Professional Edition in Version 6.0.x oder OXID eShop Enterprise Edition in Version 6.0.x Modul-Connector (kostenfrei bei erhältlich) ab Version 5.1.0.0 Installation via Composer mindestens ein freier Cronjob zur automatischen Ausführung der angelegten Aufgaben Beachten Sie, dass die Ihnen vorliegende Modulversion entsprechend für PHP 5.6 oder PHP 7.0 sowie dem auf Ihrem Server vorhandenen Decoder (ionCube Loader) kompatibel ist. Im Zweifelsfall kontaktieren Sie uns und nennen den für Ihren Shop genutzten Decoder und die PHP-Version. Kontrollieren Sie bitte auch, ob diese Modulversion für die von Ihnen eingesetzte Shopedition (Professional Edition (PE) oder Enterprise Edition (EE)) ausgelegt ist.","tags":"","url":"installation\/Anforderungen\/Systemanforderungen.html"},{"title":"Anforderungsprüfung","text":"Im Ordner docs finden Sie den Ordner Precheck. Mit dessen Inhalt können Sie die Mindestanforderungen auf Ihrem Server direkt prüfen. Kopieren Sie die enthaltenen Dateien und Ordner unverändert in das source-Verzeichnis Ihres installierten OXID-Shops. Rufen Sie nun über Ihren Browser die folgende Adresse auf: http:\/\/www.ihreadresse.de\/d3precheck.php Ihnen werden nun Details und Ergebnisse zur Anforderungsprüfung angezeigt. Löschen Sie diese Scripte mit Hilfe der in der Übersicht enthaltenen Funktion bitte unbedingt nach der Prüfung wieder von Ihrem Server.","tags":"","url":"installation\/Anforderungen\/Anforderungspruefung.html"},{"title":"Vorbereitungen","text":"Modul-Connector Installieren Sie bitte zuerst unseren Modul-Connector in der erforderlichen Version. Ob dies evtl. schon geschehen ist, können Sie im Adminbereich Ihres Shops prüfen. Existiert der Punkt Module -&gt; Modul-Connector, können Sie die installierte Version unter Bibliotheksverwaltung ablesen. Fehlt dieser Eintrag, installieren Sie den kostenfreien Connector. Informationen zu dessen Installation finden Sie auf unserer Homepage. Klicken Sie auf den Reiter Downloads und wählen dort das für Ihre Installation passende Paket. alte Modul-Dateien entfernen PHP-Dateien, Templates und Moduleinträge aus einer älteren Modul-Version als 5.0.0.0 müssen entfernt werden. Bestehende Einträge in der Datenbank bleiben weiterhin bestehen und müssen nicht entfernt werden.","tags":"","url":"installation\/Anforderungen\/Vorbereitungen.html"},{"title":"Neuinstallation","text":"php composer config repositories.d3 composer https:\/\/satis.oxidmodule.com php composer require d3\/birthdayvoucher –-update-no-dev Detailliertere Angaben zur Installation entnehmen Sie bitte den folgenden Schritten.","tags":"","url":"installation\/Neuinstallation\/index.html"},{"title":"Paketquelle hinzufügen","text":"Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Senden Sie dort diesen Befehl ab: php composer config repositories.d3 composer https:\/\/satis.oxidmodule.com Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Neuinstallation\/Paketquelle_hinzufuegen.html"},{"title":"Modul zur Installation hinzufügen","text":"Führen Sie in der Konsole im selben Verzeichnis diesen Befehl aus, um das Modul Geburtstagsgutscheine zur Installation hinzuzufügen: php composer require d3\/birthdayvoucher --update-no-dev","tags":"","url":"installation\/Neuinstallation\/Modul_hinzufuegen.html"},{"title":"Providerspezifische Installation","text":"Manche Provider erfordern besondere Einstellungen für installierte Module. Ob Ihr Anbieter spezielle Anforderungen stellt und wie diese aussehen, kontrollieren Sie bitte in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Providerspezifische_Installation.html"},{"title":"Verwendung eigener Themes","text":"Das Modul ist für die Verwendung mit den folgenden OXID-Themes vorbereitet: Flow Azure Verwenden Sie in Ihrem Shop ein angepasstes Verzeichnis für Ihre Templates (neues Theme oder CustomTheme), kopieren Sie die Templates und \/ oder die CSS-Dateien in die neuen Ordner. Ähnelt Ihr neues Theme technisch einem der OXID-Originale, können Sie dieses darauf umleiten. Childs von originalen OXID- Themes benötigen keine Umleitung. Weitere Informationen zur Umleitung finden Sie in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Verwendung_eigener_Themes.html"},{"title":"Modul im Shop aktivieren","text":"Aktivieren Sie das Modul über den Shopadmin Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Geburtstagsgutscheine auf den Button Aktivieren. Enterprise Editon: Achten Sie darauf, dass das Modul in weiteren Shops (Mall) ebenfalls aktiviert werden muss, um dessen Funktion dort auch zu nutzen.","tags":"","url":"installation\/Neuinstallation\/Modul_im_Shop_aktivieren.html"},{"title":"Shopanpassungen installieren","text":"Direkt nach der Modulaktivierung startet der Assistent, der Sie durch die Shopanpassung führt. Darin können Sie verschiedene Optionen der Installation wählen. Den Installationsassistenten finden Sie auch unter den Menüpunkten Admin -&gt; Module -&gt; Modul-Connector -&gt; Modulverwaltung -&gt; Modulinstallation. Bei tiefgreifenden Änderungen an Ihrem Shop (z.B. Hinzufügen weiterer Sprachen oder Mandanten) rufen Sie den Installationsassistenten bitte erneut auf, um dann eventuell notwendige Nacharbeiten für das Modul ausführen zu lassen. Möchten Sie die Änderungen manuell installieren, können Sie sich über diesen Assistenten ebenfalls eine Checkliste erstellen.","tags":"","url":"installation\/Neuinstallation\/Shopanpassungen_installieren.html"},{"title":"CMS-Seiten","text":"Mit der Installation des Moduls wurden CMS-Seiten angelegt. CMS-Texte sowie Sprachbausteine werden im Modul nur in der Standardsprache 1 (Deutsch) mitgeliefert. Passen Sie den Inhalt bitte an Ihre Wünsche an. Nachfolgend die Liste mit den Idents (OXLOADID): Idents Idents d3birthdayvouchermail d3bvreminderexpirationsubject d3birthdayvoucherplainmail d3bvremindermailhtml d3birthdayvouchersubjectmail d3bvreminderexpirationmailhtml d3bvreminderexpirationmailhtml d3bvremindermailplain d3bvreminderexpirationmailplain d3bvremindersubject","tags":"","url":"installation\/Neuinstallation\/CMS-Seiten.html"},{"title":"Cronjob anpassen \/ automatische Vergabe der Geburtstagsgutscheine","text":"Die Dateien für den CronJob befinden Sich im Verzeichnis \/source\/modules\/d3\/birthdayvoucher\/public\/. Die Datei d3_birthday_voucher.sh muss vor der Ausführung angepasst werden! Diese sh-Datei bitte mit einem txt-Editor öffnen und den Pfad zur startenden php-Datei anpassen. Ggf. muss der Pfad für den Aufruf des Cronjobs ebenfalls angepasst werden. Die Datei d3_birthday_voucher.sh ist u.a. für den Provider Profihost einsetzbar. Bei anderen Providern muss der Inhalt ggf. angepasst werden! Details zur Einrichtung erfahren Sie von Ihrem Provider. Technische Nachfragen richten Sie bitte direkt an den Support Ihres Providers, bei dem Ihr Shop gehostet ist. Sie sollten unbedingt den Aufruf von .sh-Dateien via Browser verhindern, so dass kein Unbefugter die Datei von außen aufrufen kann. Dazu können Sie z.B. die .htaccess-Datei des Shops um folgende Zeilen erweitern: &lt;Files *.sh&gt; Require all denied &lt;\/Files&gt;","tags":"","url":"installation\/Neuinstallation\/CronJobs.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Neuinstallation\/TMP-Ordner_leeren.html"},{"title":"Lizenzschlüssel eintragen","text":"Das Modul verwendet Lizenzschlüssel, um die Lizenzverwaltung für Sie und auch für uns einfacher zu gestalten. Hierbei haben Sie je nach Modul die Wahl zwischen einer kostenfreien Testlizenz und einer Lizenz für den Einsatz im Livebetrieb. Rufen Sie zum Anfordern des Lizenzschlüssels die Modulverwaltung im Adminbereich unter Module -&gt; Modul-Connector -&gt; Modulverwaltung auf. Klappen Sie den Eintrag des jeweiligen Moduls aus. Sofern erforderlich, können Sie hier den Lizenzassistenten starten, der schnell und einfach ihr Modul aktiviert.","tags":"","url":"installation\/Neuinstallation\/Lizenz_eintragen.html"},{"title":"Konfiguration einstellen","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Neuinstallation\/Konfiguration_einstellen.html"},{"title":"Updatefähigkeit","text":"Bei individuellen änderungen von Moduldateien empfehlen wir, jeweils die überladungsmöglichkeiten des Shops dafür zu verwenden. So brauchen Sie die originalen Moduldateien nicht verändern und erhalten sich so die Updatefähigkeit des Shops und des Moduls. Beachten Sie, dass Moduldateien bei Updateinstallationen überschrieben werden. Weitere Informationen zu den Überladungsmöglichkeiten verschiedener Dateien finden Sie in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Updatefähigkeit.html"},{"title":"Modul deaktivieren","text":"Deaktivieren Sie das Modul über den Shopadmin Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Geburtstagsgutscheine auf den Button Deaktivieren.","tags":"","url":"installation\/Update\/Modul_deaktivieren.html"},{"title":"Dateien erneuern","text":"Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Führen Sie Sie dort nacheinander folgende Befehle aus: php composer update d3\/birthdayvoucher --no-dev php composer composer clear-cache Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Update\/Dateien_erneuern.html"},{"title":"CMS-Texte anpassen","text":"Dem Modul liegen CMS-Texte bei. Diese finden Sie im Verzeichnis \/docs\/CMS. Gleichen Sie die vorhandenen CMS-Texte in Ihrem Shop mit den beigelegten CMS-Texten ab. Der Dateiname entspricht dabei dem Ident (OXLOADID).","tags":"","url":"installation\/Update\/CMS-Seiten.html"},{"title":"Cronjob anpassen \/ automatische Vergabe der Geburtstagsgutscheine","text":"Die Dateien für den CronJob befinden Sich im Verzeichnis \/source\/modules\/d3\/birthdayvoucher\/public\/. Die Datei d3_birthday_voucher.sh muss vor der Ausführung angepasst werden! Diese sh-Datei bitte mit einem txt-Editor öffnen und den Pfad zur startenden php-Datei anpassen. Ggf. muss der Pfad für den Aufruf des Cronjobs ebenfalls angepasst werden. Die Datei d3_birthday_voucher.sh ist u.a. für den Provider &quot;Profihost&quot; einsetzbar. Bei anderen Providern muss der Inhalt ggf. angepasst werden! Technische Nachfragen richten Sie bitte direkt an den Support Ihres Providers, bei dem Ihr Shop gehostet ist. Sie sollten unbedingt den Aufruf von .sh-Dateien via Browser verhindern, so dass kein Unbefugter die Datei von aussen aufrufen kann. Dazu können Sie z.B. die .htaccess-Datei des Shops um folgende Zeilen erweitern: &lt;Files *.sh&gt; Require all denied &lt;\/Files&gt;","tags":"","url":"installation\/Update\/CronJobs.html"},{"title":"Providerspezifische Installation","text":"Manche Provider erfordern besondere Einstellungen für installierte Module. Ob Ihr Anbieter spezielle Anforderungen stellt und wie diese aussehen, kontrollieren Sie bitte unter http:\/\/faq.oxidmodule.com\/Modulinstallation\/providerspezifische-Installation\/.","tags":"","url":"installation\/Update\/Providerspezifische_Installation.html"},{"title":"Modulinformationen aktualisieren","text":"Wechseln Sie im Adminbereich zu Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Geburtstagsgutscheine auf den Button Aktivieren.","tags":"","url":"installation\/Update\/Modulinformationen_aktualisieren.html"},{"title":"Shopanpassungen installierren","text":"Ob Shopanpassungen notwendig sind, ist von der Versionsänderung des Moduls abhängig. Möglicherweise sehen Sie nach dem Neuaktivieren des Moduls den Installationsassistent, der Sie durch die Änderungen führt. Folgen Sie dann den einzelnen Schritten. Möchten Sie die Änderungen manuell installieren, können Sie sich über diesen Assistenten ebenfalls eine Checkliste erstellen. Wird der Assistent nicht gezeigt (Sie sehen wieder die Modulübersicht), waren keine Anpassungen am Shop notwendig. Ob erforderliche Updates ausgeführt werden sollen, können Sie jederzeit im Adminbereich unter Module -&gt; Modul-Connector -&gt; Modulverwaltung -&gt; Modulinstallation prüfen.","tags":"","url":"installation\/Update\/Shopanpassungen_installieren.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Update\/TMP-Ordner_leeren.html"},{"title":"Konfiguration einstellen","text":"Die Einstellungen für das Modul werden ab Version 3.0 im Admin unter Module -&gt; Geburtstagsgutscheine -&gt; Konfiguration vorgenommen. Die Einstellung bei älteren Modulen befand sich bisher in der Datei config_inc.php. Modul-Einstellung müssen somit übertragen werden und können anschließend aus der Datei config_inc.php entfernt werden. Die Grund-Konfiguration des Moduls ab Version 3.0.0 ist schon in der Datenbank abgelegt und wird von der neuen Version erkannt","tags":"","url":"installation\/Update\/Konfiguration_einstellen.html"},{"title":"Modulerweiterungen deaktivieren und entfernen","text":"Deaktivieren Sie alle vorhandenen Erweiterungen, die auf dem Modul Geburtstagsgutscheine aufbauen und löschen bitte alle Dateien dieser Erweiterungen. Entfernen Sie ebenfalls alle individuellen Templateanpassungen für dieses Modul.","tags":"","url":"installation\/Deinstallation\/Modulerweiterungen_deaktivieren_und_entfernen.html"},{"title":"Modul deaktivieren","text":"Deaktivieren Sie das Modul Geburtstagsgutscheine über den Shopadmin Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Geburtstagsgutscheine auf den Button Deaktivieren.","tags":"","url":"installation\/Deinstallation\/Modul_deaktivieren.html"},{"title":"Modul aus der Installation entfernen","text":"Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Führen Sie Sie dort diesen Befehl aus: php composer remove d3\/birthdayvoucher --no-update Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Deinstallation\/Modul_aus_der_Installation_entfernen.html"},{"title":"Dateien löschen","text":"Löschen Sie den Ordner birthdayvoucher und seine enthaltenen Elemente aus dem Verzeichnis source\/modules\/d3 Ihres Shops. Bestätigen Sie anschließend im Shopadmin unter Erweiterungen -&gt; Module -&gt; Installierte Shop-Module die Nachricht: Es gibt registrierte Erweiterungen im eShop, deren Verzeichnis nicht vorhanden ist. Möchten Sie alle Modulinformationen einschließlich Konfigurationseinstellungen und Blockinformationen für Templates löschen?","tags":"","url":"installation\/Deinstallation\/Dateien_loeschen.html"},{"title":"Datenbank bereinigen","text":"","tags":"","url":"installation\/Deinstallation\/Datenbank_bereinigen.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Deinstallation\/TMP-Ordner_leeren.html"},{"title":"Getting Started","text":"It starts here.","tags":"","url":"manual\/Getting_Started.html"},{"title":"Options","text":"Some configuration options","tags":"","url":"manual\/Configuration\/Options.html"},{"title":"Hilfe und Support","text":"Bei Bedarf bieten wir Ihnen auch gern die Installation des Moduls in Ihrem Shop an. Geben Sie uns bitte unter den unten genannten Kontaktdaten Bescheid. Haben Sie Fragen oder Unklarheiten in Verbindung mit diesem Modul oder dessen Installation, stehen Ihnen Hilfetexte in unserer Modul-FAQ zur Verfügung. Finden Sie darin die benötigten Antworten nicht, kontaktieren Sie uns bitte unter den folgenden Möglichkeiten: per E-Mail: support@shopmodule.com oder über das Kontaktformular auf Oxidmodule.com oder per Telefon: (+49) 37 21 \/ 26 80 90 zu unseren Bürozeiten Geben Sie bitte an, wo und wie wir gegebenenfalls vorhandene Schwierigkeiten nachvollziehen können. Sind Ihre Fragen shopspezifisch, benötigen wir möglicherweise Zugangsdaten zum betreffenden Shop. Wir wünschen Ihnen mit Ihrem Shop und dem Modul viel Erfolg! Ihr -Team.","tags":"","url":"support\/Hilfe-und-Support.html"}]}